Nitrokey/nitrokey-pro-firmware/src/stm-std-periph/Project/STM32F10x_StdPeriph_Examples/ADC/ExtLinesTrigger/main.c
/**
  ******************************************************************************
  * @file    ADC/ExtLinesTrigger/main.c 
  * @author  MCD Application Team
  * @version V3.3.0
  * @date    04/16/2010
  * @brief   Main program body
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2010 STMicroelectronics</center></h2>
  */  
    
    /* Includes ------------------------------------------------------------------ */ 
#include "stm32f10x.h"
    
/** @addtogroup STM32F10x_StdPeriph_Examples
  * @{
  */ 
    
/** @addtogroup ADC_ExtLinesTrigger
  * @{
  */ 
    
    /* Private typedef ----------------------------------------------------------- */ 
    /* Private define ------------------------------------------------------------ */ 
#define ADC1_DR_Address    ((uint32_t)0x4001244C)
    
    /* Private macro ------------------------------------------------------------- */ 
    /* Private variables --------------------------------------------------------- */ 
    ADC_InitTypeDef ADC_InitStructure;
DMA_InitTypeDef DMA_InitStructure;
__IO uint16_t ADC_RegularConvertedValueTab[64], ADC_InjectedConvertedValueTab[32];

    /* Private function prototypes ----------------------------------------------- */ 
void RCC_Configuration (void);

void GPIO_Configuration (void);

void NVIC_Configuration (void);

void EXTI_Configuration (void);


    /* Private functions --------------------------------------------------------- */ 
    
/**
  * @brief   Main program
  * @param  None
  * @retval None
  */ 
int main (void) 
{
    
        /* !< At this stage the microcontroller clock setting is already configured,  this is done through SystemInit() function which is called
           from startup file (startup_stm32f10x_xx.s) before to branch to application main. To reconfigure the default setting of SystemInit()
           function, refer to system_stm32f10x.c file */ 
        
        /* System clocks configuration --------------------------------------------- */ 
        RCC_Configuration ();
    
        /* NVIC configuration ------------------------------------------------------ */ 
        NVIC_Configuration ();
    
        /* GPIO configuration ------------------------------------------------------ */ 
        GPIO_Configuration ();
    
        /* EXTI configuration ------------------------------------------------------ */ 
        EXTI_Configuration ();
    
        /* DMA1 channel1 configuration ---------------------------------------------- */ 
        DMA_DeInit (DMA1_Channel1);
    DMA_InitStructure.DMA_PeripheralBaseAddr = ADC1_DR_Address;
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t) ADC_RegularConvertedValueTab;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = 64;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init (DMA1_Channel1, &DMA_InitStructure);
    
        /* Enable DMA1 channel1 */ 
        DMA_Cmd (DMA1_Channel1, ENABLE);
    
        /* ADC1 configuration ------------------------------------------------------ */ 
        ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_Ext_IT11_TIM8_TRGO;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 2;
    ADC_Init (ADC1, &ADC_InitStructure);
    
        /* ADC1 regular channels configuration */ 
        ADC_RegularChannelConfig (ADC1, ADC_Channel_4, 1, ADC_SampleTime_28Cycles5);
    ADC_RegularChannelConfig (ADC1, ADC_Channel_14, 2, ADC_SampleTime_28Cycles5);
    
        /* Regular discontinuous mode channel number configuration */ 
        ADC_DiscModeChannelCountConfig (ADC1, 1);
    
        /* Enable regular discontinuous mode */ 
        ADC_DiscModeCmd (ADC1, ENABLE);
    
        /* Enable ADC1 external trigger conversion */ 
        ADC_ExternalTrigConvCmd (ADC1, ENABLE);
    
        /* Set injected sequencer length */ 
        ADC_InjectedSequencerLengthConfig (ADC1, 2);
    
        /* ADC1 injected channel configuration */ 
        ADC_InjectedChannelConfig (ADC1, ADC_Channel_11, 1, ADC_SampleTime_28Cycles5);
    ADC_InjectedChannelConfig (ADC1, ADC_Channel_12, 2, ADC_SampleTime_28Cycles5);
    
        /* ADC1 injected external trigger configuration */ 
        ADC_ExternalTrigInjectedConvConfig (ADC1, ADC_ExternalTrigInjecConv_Ext_IT15_TIM8_CC4);
    
        /* Enable ADC1 injected external trigger conversion */ 
        ADC_ExternalTrigInjectedConvCmd (ADC1, ENABLE);
    
        /* Enable JEOC interupt */ 
        ADC_ITConfig (ADC1, ADC_IT_JEOC, ENABLE);
    
        /* Enable ADC1 DMA */ 
        ADC_DMACmd (ADC1, ENABLE);
    
        /* Enable ADC1 */ 
        ADC_Cmd (ADC1, ENABLE);
    
        /* Enable ADC1 reset calibaration register */ 
        ADC_ResetCalibration (ADC1);
    
        /* Check the end of ADC1 reset calibration register */ 
        while (ADC_GetResetCalibrationStatus (ADC1));
    
        /* Start ADC1 calibaration */ 
        ADC_StartCalibration (ADC1);
    
        /* Check the end of ADC1 calibration */ 
        while (ADC_GetCalibrationStatus (ADC1));
    while (1)
        
    {
    }
}


/**
  * @brief  Configures the different system clocks.
  * @param  None
  * @retval None
  */ 
void RCC_Configuration (void) 
{
    
#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL)
        /* ADCCLK = PCLK2/2 */ 
        RCC_ADCCLKConfig (RCC_PCLK2_Div2);
    
#else /*  */
        /* ADCCLK = PCLK2/4 */ 
        RCC_ADCCLKConfig (RCC_PCLK2_Div4);
    
#endif /*  */
        /* Enable peripheral clocks ------------------------------------------------ */ 
        /* Enable DMA1 clock */ 
        RCC_AHBPeriphClockCmd (RCC_AHBPeriph_DMA1, ENABLE);
    
        /* Enable GPIOs and ADC1 clock */ 
        RCC_APB2PeriphClockCmd (RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOC |
                                RCC_APB2Periph_GPIOE | RCC_APB2Periph_AFIO | RCC_APB2Periph_ADC1, ENABLE);
} 

/**
  * @brief  Configures the different EXTI lines.
  * @param  None
  * @retval None
  */ 
void EXTI_Configuration (void) 
{
    EXTI_InitTypeDef EXTI_InitStructure;
    
        /* Select the EXTI Line11 the GPIO pin source */ 
        GPIO_EXTILineConfig (GPIO_PortSourceGPIOE, GPIO_PinSource11);
    
        /* EXTI line11 configuration ----------------------------------------------- */ 
        EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Event;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_Line = EXTI_Line11;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init (&EXTI_InitStructure);
    
        /* Select the EXTI Line15 the GPIO pin source */ 
        GPIO_EXTILineConfig (GPIO_PortSourceGPIOE, GPIO_PinSource15);
    
        /* EXTI line15 configuration ----------------------------------------------- */ 
        EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Event;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_Line = EXTI_Line15;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init (&EXTI_InitStructure);
} 

/**
  * @brief  Configures the different GPIO ports.
  * @param  None
  * @retval None
  */ 
void GPIO_Configuration (void) 
{
    GPIO_InitTypeDef GPIO_InitStructure;
    
        /* Configure PC.01, PC.02 and PC.04 (ADC Channel11, Channel12 and Channel14) as analog input
           ----------------------------------------------------------- */ 
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init (GPIOC, &GPIO_InitStructure);
    
        /* Configure PA.04 (ADC Channel4) as analog input -------------------------- */ 
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init (GPIOA, &GPIO_InitStructure);
    
        /* Configure EXTI line11 --------------------------------------------------- */ 
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init (GPIOE, &GPIO_InitStructure);
    
        /* Configure EXTI line15 --------------------------------------------------- */ 
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init (GPIOE, &GPIO_InitStructure);
} 

/**
  * @brief  Configures NVIC and Vector Table base location.
  * @param  None
  * @retval None
  */ 
void NVIC_Configuration (void) 
{
    NVIC_InitTypeDef NVIC_InitStructure;
    
        /* Configure and enable ADC interrupt */ 
#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL)
        NVIC_InitStructure.NVIC_IRQChannel = ADC1_IRQn;
    
#else /*  */
        NVIC_InitStructure.NVIC_IRQChannel = ADC1_2_IRQn;
    
#endif /*  */
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init (&NVIC_InitStructure);
} 

#ifdef  USE_FULL_ASSERT
    
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */ 
void assert_failed (uint8_t * file, uint32_t line) 
{
    
        /* User can add his own implementation to report the file name and line number, ex: printf("Wrong parameters value: file %s on line %d\r\n",
           file, line) */ 
        
        /* Infinite loop */ 
        while (1)
        
    {
    }
}


#endif /*  */
    
/**
  * @}
  */ 
    
/**
  * @}
  */ 
    
/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/ 
